//Работа с if-else
//Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
let a = 1;
if (a === 0) {
	console.log('верно');
} else {
	console.log('неверно');
}

//Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
if (a > 0) {
	console.log('верно');
} else {
	console.log('неверно');
}

//Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
if (a < 0) {
	console.log('верно');
} else {
	console.log('неверно');
}

//Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
if (a >= 0) {
	console.log('верно');
} else {
	console.log('неверно');
}

//Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
if (a <= 0) {
	console.log('верно');
} else {
	console.log('неверно');
}
//Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
if (a != 0) {
	console.log('верно');
} else {
	console.log('неверно');
}

//Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.

if (a === 1) {
	console.log('верно');
} else {
	console.log('неверно');
}
